## Pandas
Used for Data Manupulation and Analysis
- **Series** 1D array
- **Dataframe** 2D array

In [1]:
import pandas as pd
import numpy as np

In [2]:
series = pd.Series([1,2,3,4,np.nan,6,8])
series

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    6.0
6    8.0
dtype: float64

In [3]:
data = {
    'Name' : ['Hari','Sita','Gita','Batman'],
    "Age" : [23,34,23,np.nan],
    "Gender" : ['male','female','female','male'],
    "City" : ['US','Germany','India','Gotham']
}
df = pd.DataFrame(data)
df

     Name   Age  Gender     City
0    Hari  23.0    male       US
1    Sita  34.0  female  Germany
2    Gita  23.0  female    India
3  Batman   NaN    male   Gotham

In [4]:

labels = ['a','b','c','d']
se = pd.Series(data=[1,3,4,5],index=labels)

In [5]:
random_integer = np.random.randint(2, 10)
print(random_integer)

2

In [6]:
df = pd.DataFrame(np.random.randn(5,4),index=['A','B','C','D','E'],columns=['one','two','three','four'])
df

        one       two     three      four
A -0.866436 -1.038264 -0.381026  2.201821
B  0.229977 -1.646208 -0.588297  1.198907
C  1.514965  0.967426  0.065295  1.502891
D  0.787291  0.583713  0.521967  2.199692
E  0.360213  1.145815 -0.640766 -0.266441

In [7]:
df[['one','three']]

        one     three
A -0.866436 -0.381026
B  0.229977 -0.588297
C  1.514965  0.065295
D  0.787291  0.521967
E  0.360213 -0.640766

In [8]:
df.iloc[2:,2:]

      three      four
C  0.065295  1.502891
D  0.521967  2.199692
E -0.640766 -0.266441

In [9]:
lis = df.loc['E',:].tolist()
sum(lis)

0.5988202441292167

In [10]:
df['new'] = df['three']+df['one']
df

        one       two     three      four       new
A -0.866436 -1.038264 -0.381026  2.201821 -1.247462
B  0.229977 -1.646208 -0.588297  1.198907 -0.358319
C  1.514965  0.967426  0.065295  1.502891  1.580261
D  0.787291  0.583713  0.521967  2.199692  1.309259
E  0.360213  1.145815 -0.640766 -0.266441 -0.280554

In [11]:
def times2(x):
    return x*2

In [12]:
df['W_times2'] = df['one'].apply(times2)

In [13]:
df

        one       two     three      four       new  W_times2
A -0.866436 -1.038264 -0.381026  2.201821 -1.247462 -1.732872
B  0.229977 -1.646208 -0.588297  1.198907 -0.358319  0.459954
C  1.514965  0.967426  0.065295  1.502891  1.580261  3.029931
D  0.787291  0.583713  0.521967  2.199692  1.309259  1.574582
E  0.360213  1.145815 -0.640766 -0.266441 -0.280554  0.720425

In [14]:
df['lamnda_times'] = df['two'].apply(lambda x : x*2)

In [15]:
df

        one       two     three      four       new  W_times2  lamnda_times
A -0.866436 -1.038264 -0.381026  2.201821 -1.247462 -1.732872     -2.076529
B  0.229977 -1.646208 -0.588297  1.198907 -0.358319  0.459954     -3.292416
C  1.514965  0.967426  0.065295  1.502891  1.580261  3.029931      1.934853
D  0.787291  0.583713  0.521967  2.199692  1.309259  1.574582      1.167426
E  0.360213  1.145815 -0.640766 -0.266441 -0.280554  0.720425      2.291630

- axis=0 ['Row']
- axis=1 ['column']

In [16]:
df.drop('new',axis=1,inplace=True)

In [17]:
df

        one       two     three      four  W_times2  lamnda_times
A -0.866436 -1.038264 -0.381026  2.201821 -1.732872     -2.076529
B  0.229977 -1.646208 -0.588297  1.198907  0.459954     -3.292416
C  1.514965  0.967426  0.065295  1.502891  3.029931      1.934853
D  0.787291  0.583713  0.521967  2.199692  1.574582      1.167426
E  0.360213  1.145815 -0.640766 -0.266441  0.720425      2.291630

In [18]:
df>10

     one    two  three   four  W_times2  lamnda_times
A  False  False  False  False     False         False
B  False  False  False  False     False         False
C  False  False  False  False     False         False
D  False  False  False  False     False         False
E  False  False  False  False     False         False

## Missing Data

In [19]:
df.iloc[0][3] = np.nan
df.iloc[0][3]

C:\Users\HP\AppData\Local\Temp\ipykernel_13160\1962947310.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.iloc[0][3] = np.nan

2.2018209774541875

In [20]:
new_Data = {
    'ONE': [1,2,np.nan,4],
    'Two' : [np.nan,3,9,np.nan],
    'three':[4,56,7,7]
}
new_df = pd.DataFrame(new_Data)

In [21]:
new_df.dropna(axis=1)

   three
0      4
1     56
2      7
3      7

In [22]:
new_df.dropna(axis=1,thresh=4)

   three
0      4
1     56
2      7
3      7

In [23]:
new_df.fillna(value=new_df['ONE'].mean(),axis =1)

        ONE       Two  three
0  1.000000  2.333333    4.0
1  2.000000  3.000000   56.0
2  2.333333  9.000000    7.0
3  4.000000  2.333333    7.0

In [24]:
import pandas as pd
import numpy as np

# Create a sample DataFrame
data = {'A': [1, 2, np.nan, 4],
        'B': [np.nan, 6, np.nan, 8],
        'C': [11, 12, 13, 14]}

new_df = pd.DataFrame(data)
print(len(new_df))
# Keep columns with at least 2 null values
result_df = new_df.dropna(thresh=len(new_df) - 1, axis=1)

# Display the original and resulting DataFrames
print("Original DataFrame:")
print(new_df)

print("\nDataFrame after keeping columns with at least 2 null values:")
print(result_df)

4
Original DataFrame:
     A    B   C
0  1.0  NaN  11
1  2.0  6.0  12
2  NaN  NaN  13
3  4.0  8.0  14

DataFrame after keeping columns with at least 2 null values:
     A   C
0  1.0  11
1  2.0  12
2  NaN  13
3  4.0  14

# Data

In [25]:
d = {
    'Company':['Facebook','Google','Netflix','Amazon','Google','Netflix'],
    'Sales':[4000,5000,2000,3000,5000,12000],
    'Product':['SAAS','PAAS','SAAS','SAAS','Service','SAAS']
}
df = pd.DataFrame(d)

In [26]:
df

    Company  Sales  Product
0  Facebook   4000     SAAS
1    Google   5000     PAAS
2   Netflix   2000     SAAS
3    Amazon   3000     SAAS
4    Google   5000  Service
5   Netflix  12000     SAAS

## group_by Function
- It groups the common row in a given column. and use .mean(), .sum().

In [27]:
byComp = df[['Company','Sales']].groupby('Company')
byComp.mean() # the mean was showing error because it was not able to mean the string 'product'.so we used
              # Company and Product Column.

           Sales
Company
Amazon    3000.0
Facebook  4000.0
Google    5000.0
Netflix   7000.0

In [28]:
byProduc = df[['Product','Sales']].groupby('Product')
byProduc.mean()

          Sales
Product
PAAS     5000.0
SAAS     5250.0
Service  5000.0

## Describe Method
- this method provides, mean, count, max, std
- .round() function outputs a custom floating point

In [29]:
df.describe().round(3)

           Sales
count      6.000
mean    5166.667
std     3544.949
min     2000.000
25%     3250.000
50%     4500.000
75%     5000.000
max    12000.000

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  6 non-null      object
 1   Sales    6 non-null      int64
 2   Product  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [31]:
# Creating two sample DataFrames
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'key': ['K0', 'K1', 'K2', 'K3']
                    },index=['1','2','3','4'])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'key': ['K0', 'K1', 'K2', 'K3']})

df3 = pd.DataFrame({'C': ['C1', 'C2', 'C3', 'C4'],
                    'D': ['D1', 'D2', 'D3', 'D4'],
                    'keyio': ['K0', 'K1', 'K2', 'K3']},index=['1','2','3','4'])
# Concatenating along rows (axis=0)
result_row = pd.concat([df1, df2])
# Concatenating along COLUMNS (axis=1)
result_column = pd.concat([df1, df3], axis=1)

print(result_column)

    A   B key   C   D keyio
1  A0  B0  K0  C1  D1    K0
2  A1  B1  K1  C2  D2    K1
3  A2  B2  K2  C3  D3    K2
4  A3  B3  K3  C4  D4    K3

In [32]:
print(result_row)

    A   B key
1  A0  B0  K0
2  A1  B1  K1
3  A2  B2  K2
4  A3  B3  K3
0  A4  B4  K0
1  A5  B5  K1
2  A6  B6  K2
3  A7  B7  K3

## Merge

In [33]:
df3

    C   D keyio
1  C1  D1    K0
2  C2  D2    K1
3  C3  D3    K2
4  C4  D4    K3

In [34]:
df1

    A   B key
1  A0  B0  K0
2  A1  B1  K1
3  A2  B2  K2
4  A3  B3  K3

In [35]:
# The keysa of both dataframe are same so , we can use merge function
pd.merge(df1,df3,how='inner',on='key')

KeyError: 'key'

In [36]:
pd.merge(df1,df3,how='outer',on='key')

KeyError: 'key'

In [37]:
df1

    A   B key
1  A0  B0  K0
2  A1  B1  K1
3  A2  B2  K2
4  A3  B3  K3

In [38]:
df3

    C   D keyio
1  C1  D1    K0
2  C2  D2    K1
3  C3  D3    K2
4  C4  D4    K3

In [39]:
# join operation join df on the basis of index
join_df = df1.join( df3,how ='inner' )
join_df

    A   B key   C   D keyio
1  A0  B0  K0  C1  D1    K0
2  A1  B1  K1  C2  D2    K1
3  A2  B2  K2  C3  D3    K2
4  A3  B3  K3  C4  D4    K3

In [40]:
jimo = pd.DataFrame({
    'Category':['a','b','c','d','e','b','c','a'],
    'Values':[45,4,32,12,34,67,98,100]
})
jimo

  Category  Values
0        a      45
1        b       4
2        c      32
3        d      12
4        e      34
5        b      67
6        c      98
7        a     100

In [41]:
jimo['Category'].nunique()

5

In [42]:
jimo['Category'].value_counts()

Category
a    2
b    2
c    2
d    1
e    1
Name: count, dtype: int64

In [43]:
jimo

  Category  Values
0        a      45
1        b       4
2        c      32
3        d      12
4        e      34
5        b      67
6        c      98
7        a     100

In [44]:
jimo['Category'].duplicated().sum()

3

## Sort value by columns

In [46]:
jimo.sort_values(by='Values')

  Category  Values
1        b       4
3        d      12
2        c      32
4        e      34
0        a      45
5        b      67
6        c      98
7        a     100